modules/ome-clojure.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Oh My Emacs Clojure</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Oh My Emacs Clojure"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-30T17:03+0800"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Oh My Emacs Clojure</h1>

<p>This is part of the <a href="https://github.com/xiaohanyu/oh-my-emacs">oh-my-emacs</a>.
</p>
<p>
This file contains some settings for <a href="#sec-3">Clojure</a> programming language.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#clojure-prerequisites">Prerequisites</a></li>
<li><a href="#clojure-el-get-packages">El-get packages</a></li>
<li><a href="#clojure">Clojure</a></li>
<li><a href="#sec-4">Todos</a></li>
</ul>
</div>
</div>

<div id="outline-container-clojure-prerequisites" class="outline-2">
<h2 id="clojure-prerequisites"><a name="sec-1" id="sec-1"></a>Prerequisites</h2>
<div class="outline-text-2" id="text-clojure-prerequisites">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption>Prerequisites for ome-clojure module</caption>
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left"></th><th scope="col" class="left">Windows</th><th scope="col" class="left">Ubuntu/Debian/Mint</th><th scope="col" class="left">ArchLinux</th><th scope="col" class="left">Fedora</th><th scope="col" class="left">Mac OS X</th><th scope="col" class="left">Mandatory?</th></tr>
</thead>
<tbody>
<tr><td class="left"><a href="http://leiningen.org/">Leiningen</a></td><td class="left">[web]</td><td class="left">[web]</td><td class="left">[web]</td><td class="left">[web]</td><td class="left">[web]</td><td class="left">Yes</td></tr>
</tbody>
</table>


<p>
Note:
</p><ul>
<li><a href="http://leiningen.org/">Leiningen</a> for Clojure. I recommend you install leiningen from the official
  website to keep update with the lastest version.
</li>
</ul>


</div>

</div>

<div id="outline-container-clojure-el-get-packages" class="outline-2">
<h2 id="clojure-el-get-packages"><a name="sec-2" id="sec-2"></a>El-get packages</h2>
<div class="outline-text-2" id="text-clojure-el-get-packages">


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption>El-get packages for ome-clojure module</caption>
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left"></th><th scope="col" class="left">Status</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left"><a href="https://github.com/clojure-emacs/clojure-mode">clojure-mode</a></td><td class="left">Required</td><td class="left">Major mode for Clojure.</td></tr>
<tr><td class="left"><a href="https://github.com/clojure-emacs/cider">CIDER</a></td><td class="left">Required</td><td class="left">CIDER is a Clojure IDE and REPL for Emacs</td></tr>
<tr><td class="left"><a href="https://github.com/purcell/ac-nrepl.git">ac-nrepl</a></td><td class="left">Required</td><td class="left">AC backend for nrepl.</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-clojure" class="outline-2">
<h2 id="clojure"><a name="sec-3" id="sec-3"></a>Clojure</h2>
<div class="outline-text-2" id="text-clojure">


<p>
<a href="http://www.clojure.org">Clojure</a> is a modern Lisp on top of JVM, it is a member of the Lisp family of
languages. Clojure extends the code-as-data system beyond parenthesized lists
(s-expressions) to vectors and maps.
</p>
<p>
Since Clojure is a Lisp dialect, it should work the SLIME way. Yeah, first
comes <a href="https://github.com/technomancy/swank-clojure">swank-clojure</a>, then <a href="https://github.com/clojure-emacs/cider">CIDER</a><sup><a class="footref" name="fnr-.1" href="#fn-.1">1</a></sup>. The only thing you need to install is
<a href="http://leiningen.org/">leiningen</a> 2.x. I recommend you to install it manually, since not all <a href="https://github.com/technomancy/leiningen/wiki/Packaging">package manager</a> provides the latest version.
</p>
<p>
The general way to install lastest stable leiningen is:
</p>


<pre class="example">wget -O /tmp/lein https://raw.github.com/technomancy/leiningen/stable/bin/lein
sudo mv /tmp/lein /usr/bin/lein
lein version
</pre>


<p>
Or you can see leiningen's <a href="https://github.com/technomancy/leiningen/wiki/Upgrading">wiki</a> for upgrading details.
</p>
<p>
Now, just open a clojure file, then <code>cider-jack-in</code>, and you can program
Clojure the SLIME way. <a href="http://vimeo.com/22798433">Here</a> is an awesome live demo to demonstrate the Clojure
workflow.
</p>
<p>
It's really really awesome, ah?
</p>



<pre class="example">(ome-install 'clojure-mode)

(defun ome-cider-setup ()
  (add-hook 'cider-mode-hook 'cider-turn-on-eldoc-mode)
  (setq cider-repl-tab-command 'indent-for-tab-command)
  (setq cider-repl-pop-to-buffer-on-connect nil)
  (setq cider-popup-stacktraces nil)
  (setq cider-repl-popup-stacktraces t)
  (setq cider-auto-select-error-buffer t)
  (setq nrepl-hide-special-buffers t)
  (setq nrepl-buffer-name-separator "-")
  (setq nrepl-buffer-name-show-port t))

(ome-install 'cider)

(defun ome-ac-nrepl-setup ()
  (add-hook 'cider-mode-hook 'ac-nrepl-setup)
  (add-hook 'cider-repl-mode-hook 'ac-nrepl-setup)
  (eval-after-load "auto-complete"
    '(add-to-list 'ac-modes 'cider-repl-mode)))

(ome-install 'ac-nrepl)
</pre>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Todos</h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>The boot up speed of JVM is too slow, so we may need to refer to
  <a href="http://icylisper.github.io/jark/">http://icylisper.github.io/jark/</a>.
</li>
</ul>


<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn-.1" href="#fnr-.1">1</a></sup> CIDER was formerly known as and renamed from <code>nrepl.el</code>.
</p>


</div>
</div>

</div>
</div>
</div>

</body>
</html>
